---
kind: type
id: T:Autodesk.Revit.DB.StructuralReleaseType
source: html/48b5b1f8-9c23-7071-0b9a-52f5a5322027.htm
---
# Autodesk.Revit.DB.StructuralReleaseType

Type of structural release, which is used for the BuiltIn parameter STRUCTURAL_END_RELEASE_TYPE.

## Syntax (C#)
```csharp
public enum StructuralReleaseType
```